### Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
labels=['a','b','c']

In [3]:
mylist=[10,20,30]

In [4]:
arr = np.array(mylist)
arr

array([10, 20, 30])

In [5]:
d={'a':10,'b':20,'c':30}

In [6]:
d

{'a': 10, 'b': 20, 'c': 30}

In [7]:
pd.Series(data=mylist)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [9]:
pd.Series(arr,index=labels)

a    10
b    20
c    30
dtype: int32

In [10]:
pd.Series(data=['a',1,1.1])

0      a
1      1
2    1.1
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4],index=['USA','GERMANY','INDIA','JAPAN'])

In [12]:
ser1

USA        1
GERMANY    2
INDIA      3
JAPAN      4
dtype: int64

In [13]:
ser1['INDIA']

3

In [14]:
ser2=pd.Series([1,4,5,6],index=['USA','GERMANY','INDIA','SRI'])

In [15]:
ser2

USA        1
GERMANY    4
INDIA      5
SRI        6
dtype: int64

In [16]:
ser1 + ser2

GERMANY    6.0
INDIA      8.0
JAPAN      NaN
SRI        NaN
USA        2.0
dtype: float64

### DataFrame-Part1

In [17]:
from numpy.random import randn
np.random.seed(101)

rand_mat=randn(5,4)

In [18]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [19]:
df = pd.DataFrame(data=rand_mat)

In [20]:
df

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [21]:
'A B C D'.split() # fastest way for create the list

['A', 'B', 'C', 'D']

In [22]:
df = pd.DataFrame(data=rand_mat,index='A B C D E'.split())

In [23]:
df

          0         1         2         3
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df = pd.DataFrame(data=rand_mat,index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
# selecting the columns

df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [26]:
type(df['W'])

pandas.core.series.Series

In [27]:
# mylist=['W','Y'] # multiple columns selected
# df[mylistlist]

In [28]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [29]:
df.W # not recoomded due methods will be confused if tab after .

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [30]:
df[['Y','W']]

          Y         W
A  0.907969  2.706850
B -0.848077  0.651118
C  0.528813 -2.018168
D -0.933237  0.188695
E  2.605967  0.190794

In [31]:
# create new column
df['NEW'] = df['W'] + df['Y']

In [32]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [33]:
# drop column
df.drop('NEW',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df # still new column there

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [35]:
# permently drop column
df.drop('NEW',axis=1,inplace=True)

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
# drop the row
df.drop('A')

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df.drop('A',inplace=True)

In [40]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df.loc['B'] # location of rows

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [42]:
df.loc[['B','C']]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [43]:
df.iloc[0]  # location of index

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [44]:
df.iloc[[0,3]]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df.loc[['B','C']][['Y','Z']]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001

In [47]:
df.loc[['C','D'],['X','Y']]

          X         Y
C  0.740122  0.528813
D -0.758872 -0.933237

### DataFrame Part-2

In [48]:
# conditional selection in dataframe

In [49]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df>0

       W      X      Y      Z
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [51]:
df_bool = df>0

In [52]:
df_bool

       W      X      Y      Z
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [53]:
df[df_bool]

          W         X         Y         Z
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df[df>0]

          W         X         Y         Z
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df[df['W']>0]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
# stacking operation
df[df['W']>0]['Y'].loc['B']

-0.8480769834036315

In [58]:
df['Y'].loc['B']

-0.8480769834036315

In [59]:
cond1 = df['W']>0
cond2 = df['W']<1

In [60]:
cond1

B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [61]:
cond2

B    True
C    True
D    True
E    True
Name: W, dtype: bool

In [62]:
df[cond1 | cond2]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
df[ cond1 & cond2 ]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df[(df['W']<0) & (df['Y']<1)]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [65]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df.reset_index()

  index         W         X         Y         Z
0     B  0.651118 -0.319318 -0.848077  0.605965
1     C -2.018168  0.740122  0.528813 -0.589001
2     D  0.188695 -0.758872 -0.933237  0.955057
3     E  0.190794  1.978757  2.605967  0.683509

In [67]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
new_index = 'CA NY WY OR'.split()

In [69]:
df['States']=new_index

In [70]:
df

          W         X         Y         Z States
B  0.651118 -0.319318 -0.848077  0.605965     CA
C -2.018168  0.740122  0.528813 -0.589001     NY
D  0.188695 -0.758872 -0.933237  0.955057     WY
E  0.190794  1.978757  2.605967  0.683509     OR

In [71]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.651118 -0.319318 -0.848077  0.605965
NY     -2.018168  0.740122  0.528813 -0.589001
WY      0.188695 -0.758872 -0.933237  0.955057
OR      0.190794  1.978757  2.605967  0.683509

In [72]:
df # if inplace = True then will impact on original df

          W         X         Y         Z States
B  0.651118 -0.319318 -0.848077  0.605965     CA
C -2.018168  0.740122  0.528813 -0.589001     NY
D  0.188695 -0.758872 -0.933237  0.955057     WY
E  0.190794  1.978757  2.605967  0.683509     OR

In [73]:
df.set_index('States',inplace=True)

In [74]:
df

               W         X         Y         Z
States
CA      0.651118 -0.319318 -0.848077  0.605965
NY     -2.018168  0.740122  0.528813 -0.589001
WY      0.188695 -0.758872 -0.933237  0.955057
OR      0.190794  1.978757  2.605967  0.683509

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to OR
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       4 non-null      float64
 1   X       4 non-null      float64
 2   Y       4 non-null      float64
 3   Z       4 non-null      float64
dtypes: float64(4)
memory usage: 160.0+ bytes

In [76]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [77]:
df.describe()

              W         X         Y         Z
count  4.000000  4.000000  4.000000  4.000000
mean  -0.246890  0.410172  0.338367  0.413883
std    1.200715  1.220402  1.653573  0.685137
min   -2.018168 -0.758872 -0.933237 -0.589001
25%   -0.363021 -0.429207 -0.869367  0.307224
50%    0.189745  0.210402 -0.159632  0.644737
75%    0.305875  1.049781  1.048102  0.751396
max    0.651118  1.978757  2.605967  0.955057

In [78]:
df

               W         X         Y         Z
States
CA      0.651118 -0.319318 -0.848077  0.605965
NY     -2.018168  0.740122  0.528813 -0.589001
WY      0.188695 -0.758872 -0.933237  0.955057
OR      0.190794  1.978757  2.605967  0.683509

In [79]:
df['W']>0

States
CA     True
NY    False
WY     True
OR     True
Name: W, dtype: bool

In [80]:
ser_w = df['W']>0

In [81]:
ser_w.value_counts()

True     3
False    1
Name: W, dtype: int64

In [82]:
sum(ser_w) # will show true values

3

In [83]:
len(ser_w)

4

### Missing Data With Pandas

In [84]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [85]:
df.dropna() # delete all row that have nan value

     A    B  C
0  1.0  5.0  1

In [86]:
df.dropna(axis=1) # delete all column that have nan value

   C
0  1
1  2
2  3

In [87]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [88]:
df.dropna(thresh=2)# df.dropna but atleast 2 nan

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [89]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [90]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [91]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [92]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [93]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby opeartion

In [94]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [95]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [96]:
df=pd.DataFrame(data)

In [97]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [98]:
df.groupby('Company').mean() # mean,sum,avg

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [99]:
df.groupby('Company')[['Sales']].mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [100]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

### Comman Opeartions

In [101]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
})

In [102]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [103]:
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [104]:
df.tail(1)

   col1  col2 col3
3     4   444  xyz

In [105]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [106]:
len(df['col2'].unique())

3

In [107]:
df['col2'].nunique()

3

In [108]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [109]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [110]:
# col1 > 2
# col2 == 444
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [111]:
newdf

   col1  col2 col3
3     4   444  xyz

In [112]:
newdf=df[(df['col1']>2) | (df['col2']==444)]
newdf

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

In [113]:
def times_two(number):
    return number*2

In [114]:
times_two(4)

8

In [115]:
# apply function df
df.apply(times_two)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [116]:
df['new']=df['col1'].apply(times_two)

In [117]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [118]:
del df['new'] # or >> df.drop(df['new'])

In [119]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [120]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [121]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [122]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [123]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [124]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [125]:
# sort
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [126]:
df.sort_values(by='col2',ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

### Data Input and Output

In [127]:
pwd

'D:\\TSA\\Pandas'

In [128]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [129]:
df=pd.read_csv('D:\\TSA\\Pandas\\example.csv')

In [130]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [131]:
newdf=df[['a','b']]

In [132]:
newdf

    a   b
0   0   1
1   4   5
2   8   9
3  12  13

In [133]:
newdf.to_csv('mynew.csv',index=True)

In [134]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [135]:
df = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [136]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [137]:
df.drop('Unnamed: 0',axis=1)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [165]:
url = "https://www.w3schools.com/html/html_tables.asp"
dfs = pd.read_html(url)
df = dfs[0]
df

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [167]:
url = "https://globstime.com/ipl-schedule-time-table-venues-new-teams/"
dfs = pd.read_html(url)
df = dfs[0]
df

       Match      Date                                          Venue     Time
0    Match 1  30 March                       Wankhede Stadium, Mumbai  7:30 PM
1    Match 2  31 March                          Eden Gardens, Kolkata  7:30 PM
2    Match 3   1 April              M. Chinnaswamy Stadium, Bengaluru  7:30 PM
3    Match 4   2 April  Rajiv Gandhi International Stadium, Hyderabad  7:30 PM
4    Match 5   3 April                 Feroz Shah Kotla Ground, Delhi  7:30 PM
5    Match 6   4 April                 Sawai Mansingh Stadium, Jaipur  3:30 PM
6    Match 7   4 April                MA Chidambaram Stadium, Chennai  7:30 PM
7    Match 8   5 April                       Wankhede Stadium, Mumbai  7:30 PM
8    Match 9   6 April                          Eden Gardens, Kolkata  7:30 PM
9   Match 10   7 April              M. Chinnaswamy Stadium, Bengaluru  7:30 PM
10  Match 11   8 April  Rajiv Gandhi International Stadium, Hyderabad  7:30 PM
11  Match 12   9 April                 Feroz Shah Kotla Ground, Delhi  7:30 PM
12  Match 13  10 April                 Sawai Mansingh Stadium, Jaipur  3:30 PM
13  Match 14  10 April                MA Chidambaram Stadium, Chennai  7:30 PM
14  Match 15  11 April                       Wankhede Stadium, Mumbai  7:30 PM
15  Match 16  12 April                          Eden Gardens, Kolkata  7:30 PM
16  Match 17  13 April              M. Chinnaswamy Stadium, Bengaluru  7:30 PM
17  Match 18  14 April  Rajiv Gandhi International Stadium, Hyderabad  7:30 PM
18  Match 19  15 April                        Feroz Shah Kotla Ground      NaN

In [168]:
len(dfs)

7